W7D5/RedditClone/app/controllers/subs_controller.rb

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "yayy!"], ["updated_at", "2021-06-25 19:21:37.312593"], ["id", 1]]
---
  def update
    @sub = Sub.find(params[:id])
    if @sub.update(sub_params)