W7D2/classify/app/controllers/application_controller.rb

    def current_user
        current_user ||= User.find_by(session_token: session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "Ec8_zxdAp0A5LcOFPgp9Ig"], ["LIMIT", 1]]